#include<iostream>
using namespace std;

//
//2D niz na slici predstavlja šahovsku tablu.Napraviti i testirati u main programu slijedeće funkcije :
//
//C - Crna
//B - Bijela
//```
//+ ---- - +---- - +---- - +---- - +---- - +---- - +---- - +---- - +
//| C00 | B01 | C02 | B03 | C04 | B05 | C06 | B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |
//+---- - +---- - +---- - +---- - +---- - +---- - +---- - +---- - +
//| B10 | C11 | B12 | C13 | B14 | C15 | B16 | C17 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |
//+---- - +---- - +---- - +---- - +---- - +---- - +---- - +---- - +
//| C20 | B21 | C22 | B23 | C24 | B25 | C26 | B27 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |
//+---- - +---- - +---- - +---- - +---- - +---- - +---- - +---- - +
//| B30 | C31 | B32 | C33 | B34 | C35 | B36 | C37 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |
//+---- - +---- - +---- - +---- - +---- - +---- - +---- - +---- - +
//| C40 | B41 | C42 | B43 | C44 | B45 | C46 | B47 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |
//+---- - +---- - +---- - +---- - +---- - +---- - +---- - +---- - +
//| B50 | C51 | B52 | C53 | B54 | C55 | B56 | C57 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |
//+---- - +---- - +---- - +---- - +---- - +---- - +---- - +---- - +
//| C60 | B61 | C62 | B63 | C64 | B65 | C66 | B67 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |
//+---- - +---- - +---- - +---- - +---- - +---- - +---- - +---- - +
//| B70 | C71 | B72 | C73 | B74 | C75 | B76 | C77 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |B07 |
//+---- - +---- - +---- - +---- - +---- - +---- - +---- - +---

const int dx = 8;
const int dy = 16;
void ispis(char niz[][dy]) {

	for (int i = 0; i < dx; i++)
	{

		for (int j = 0; j < dy; j++)
		{
			cout << niz[i][j] << " ";
		}cout << endl;
	}

}


int matrica2main() {

	char niz[dx][dy];




	for (int i = 0; i < dx; i++)
	{
		cout << i << " x " << endl;
		for (int j = 0; j < dy; j++)
		{
			cout << j << "y ";
			niz[i][j] = 'a';
		}cout << endl;
	}



	for (int i = 0; i < dx; i++)
	{
		for (int j = 0; j < dy; j++)
		{

			if ((i % 2 == 0 && j % 2 == 0) || (i % 2 != 0 && j % 2 != 0))
			{
				niz[i][j] = '*';
			}

			else {
				niz[i][j] = '==';
			}
		}
	}




	ispis(niz);

	return 0;
}